# StairsRunWinderBeginWithStraight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunWinderBeginWithStraight Property
ParameterTypeId Class See Also
---
"Begin with Straight Run": Winder begin with straight run
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunWinderBeginWithStraight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunWinderBeginWithStraight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunWinderBeginWithStraight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace